#+BEGIN_COMMENT
.. title: Autocorrect: Minimum Edit Distance
.. slug: autocorrect-minimum-edit-distance
.. date: 2020-11-07 22:23:42 UTC-08:00
.. tags: nlp,autocorrect,edit distance
.. category: NLP
.. link: 
.. description: Finding the autocorrect word closest to the original.
.. type: text
.. has_math: True
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3

#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-e668b76a-2107-4eb7-8eb7-180f33dc56b9-ssh.json

#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
*** play to stay
#+begin_src python :results output :exports both
source =  'play'
target = 'stay'
matrix, min_edits = min_edit_distance(source, target)
print("minimum edits: ",min_edits, "\n")
idx = list('#' + source)
cols = list('#' + target)
expected = pandas.DataFrame(numpy.array([
    [0,  1,  2,  3,  4],
    [1,  2,  3,  4,  5],
    [2,  3,  4,  5,  6],
    [3,  4,  5,  4,  5],
    [4,  5,  6,  5,  4],
]), index=idx, columns=cols)
actual = pandas.DataFrame(matrix, index=idx, columns= cols)
print(actual)
assert min_edits==4

assert all(expected == actual)
#+end_src

#+RESULTS:
: minimum edits:  4 
: 
:    #  s  t  a  y
: #  0  1  2  3  4
: p  1  2  3  4  5
: l  2  3  4  5  6
: a  3  4  5  4  5
: y  4  5  6  5  4

*** eer to near
#+begin_src python :results output :exports both
source =  'eer'
target = 'near'
matrix, min_edits = min_edit_distance(source, target)
print("minimum edits: ",min_edits, "\n")
idx = list(source)
idx.insert(0, '#')
cols = list(target)
cols.insert(0, '#')
actual = pandas.DataFrame(matrix, index=idx, columns= cols)
print(actual)
expected = pandas.DataFrame([
    [0,  1,  2,  3,  4],
    [1,  2,  1,  2,  3],
    [2,  3,  2,  3,  4],
    [3,  4,  3,  4,  3],
    ], index=idx, columns=cols)
assert all(expected == actual)
assert min_edits == 3
#+end_src

#+RESULTS:
: minimum edits:  3 
: 
:    #  n  e  a  r
: #  0  1  2  3  4
: e  1  2  1  2  3
: e  2  3  2  3  4
: r  3  4  3  4  3
*** intention to execution
#+begin_src python :results output :exports both
source = "intention"
target = "execution"
matrix, min_edits = min_edit_distance(source, target)
print("minimum edits: ",min_edits, "\n")
index = list("#" + source)
columns = list("#" + target)
actual = pandas.DataFrame(matrix, index=index, columns=columns)
print(actual)
expected = pandas.DataFrame([
    [0, 1, 2,  3,  4,  5,  6,  7,  8,  9],
    [1, 2, 3,  4,  5,  6,  7,  6,  7,  8],
    [2, 3, 4,  5,  6,  7,  8,  7,  8,  7],
    [3, 4, 5,  6,  7,  8,  7,  8,  9,  8],
    [4, 3, 4,  5,  6,  7,  8,  9, 10,  9],
    [5, 4, 5,  6,  7,  8,  9, 10, 11, 10],
    [6, 5, 6,  7,  8,  9,  8,  9, 10, 11],
    [7, 6, 7,  8,  9, 10,  9,  8,  9, 10],
    [8, 7, 8,  9, 10, 11, 10,  9,  8,  9],
    [9, 8, 9, 10, 11, 12, 11, 10,  9,  8],
], index=index, columns=columns)

assert all(expected == actual)
assert min_edits == 8
#+end_src

#+RESULTS:
#+begin_example
minimum edits:  8 

   #  e  x   e   c   u   t   i   o   n
#  0  1  2   3   4   5   6   7   8   9
i  1  2  3   4   5   6   7   6   7   8
n  2  3  4   5   6   7   8   7   8   7
t  3  4  5   6   7   8   7   8   9   8
e  4  3  4   5   6   7   8   9  10   9
n  5  4  5   6   7   8   9  10  11  10
t  6  5  6   7   8   9   8   9  10  11
i  7  6  7   8   9  10   9   8   9  10
o  8  7  8   9  10  11  10   9   8   9
n  9  8  9  10  11  12  11  10   9   8
#+end_example
*** Two Letter Edits
The 'replace()' routine utilizes all letters a-z one of which returns the original word.

#+begin_src python :results output :exports both
source = "eer"
targets = suggestor.two_letter_edits(source)
for t in targets:
    _, min_edits = min_edit_distance(source, t,rep_cost=rep_cost)
    if min_edits != 2 and min_edits != 1: print(source, t, min_edits)
#+end_src

#+RESULTS:
: eer eer 0

# **Expected Results**  
# ```CPP
# eer eer 0
# ```

We have to allow single edits here because some two_edits will restore a single edit.

** Test Out the Minimum Distance
#+begin_src python :results none
from neurotic.nlp.autocorrect.distance import MinimumEdits

SOURCE, TARGET = "cow", "dog"
editor = MinimumEdits(source=SOURCE, target=TARGET)
assert editor.rows == len(SOURCE)
assert editor.columns == len(TARGET)

assert editor.distance_table.shape == (len(SOURCE) + 1, len(TARGET) + 1)
assert (editor.distance_table[:, 0] == numpy.arange(editor.rows + 1, dtype=int)).all()
assert (editor.distance_table[0, :] == numpy.arange(editor.columns + 1, dtype=int)).all()
assert (editor.distance_table == numpy.array([[0, 1, 2, 3],
                                              [1, 2, 3, 4],
                                              [2, 3, 2, 3],
                                              [3, 4, 3, 4]])).all()
assert editor.minimum_distance == 4
#+end_src

#+begin_src python :results none
editor = MinimumEdits(source="play", target="stay")
assert editor.minimum_distance == 4
#+end_src

#+begin_src python :results none
editor = MinimumEdits(source="eer", target="near")
assert editor.minimum_distance == 3
#+end_src

#+begin_src python :results none
editor = MinimumEdits(source="intention", target="execution")
assert editor.minimum_distance == 8
#+end_src

#+begin_src python :results output :exports both
print(editor.distance_frame)
#+end_src

#+RESULTS:
:    #  d  o  g
: #  0  1  2  3
: c  1  2  3  4
: o  2  3  2  3
: w  3  4  3  4

#+begin_src python :results output :exports both
print(str(editor))
#+end_src

#+RESULTS:
|    |   # |   d |   o |   g |
|----+-----+-----+-----+-----|
| #  |   0 |   1 |   2 |   3 |
| c  |   1 |   2 |   3 |   4 |
| o  |   2 |   3 |   2 |   3 |
| w  |   3 |   4 |   3 |   4 |
